<h1>Cleaning and Merging the test datasets and making it ready for predictions</h1>

In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
from io import StringIO
import re

<h3>Reading the test set files one by one </h3>

In [2]:
#Reading the Previous loan status data file

In [3]:
test_pre_loan = pd.read_csv("Test_Sample/TEST_Previous_Loan_Holdings.csv",encoding='latin1')

In [4]:
test_pre_loan = test_pre_loan[["Client ID", "Held Loan previously"]]

In [5]:
test_pre_loan.head()

   Client ID  Held Loan previously
0      10001                     0
1      10002                     0
2      10003                     0
3      10004                     0
4      10005                     0

In [6]:
test_pre_loan.dtypes

Client ID               int64
Held Loan previously    int64
dtype: object

In [7]:
test_pre_loan[test_pre_loan["Client ID"].duplicated()]

Empty DataFrame
Columns: [Client ID, Held Loan previously]
Index: []

In [8]:
test_pre_loan.isnull().sum()

Client ID               0
Held Loan previously    0
dtype: int64

In [9]:
test_pre_loan.describe()

         Client ID  Held Loan previously
count  10004.00000          10004.000000
mean   15002.50000              0.248701
std     2888.05038              0.432281
min    10001.00000              0.000000
25%    12501.75000              0.000000
50%    15002.50000              0.000000
75%    17503.25000              0.000000
max    20004.00000              1.000000

In [10]:
test_pre_loan.shape

(10004, 2)

In [11]:
#Reading the Demographics data file

In [12]:
test_demographics = pd.read_csv("Test_Sample/TEST_Demographics.csv",encoding='latin1')

In [13]:
test_demographics.columns=test_demographics.columns.str.replace(':','')
test_demographics.columns=test_demographics.columns.str.replace(',','')
test_demographics.columns=test_demographics.columns.str.replace('\n','')

In [14]:
test_demographics.rename(columns = {"Gender 1 Female 2 Male": "Gender"}, inplace = True)

In [15]:
test_demographics.head()

   Client ID  Age  Gender  County    Income Group
0      10001   59       1    Cork   10001 - 40000
1      10002   27       1   Kerry   10001 - 40000
2      10003   58       0   Louth   10001 - 40000
3      10004   45       1  Dublin  60001 - 100000
4      10005   21       0  Dublin   40001 - 60000

In [16]:
test_demographics.dtypes

Client ID        int64
Age              int64
Gender           int64
County          object
Income Group    object
dtype: object

In [17]:
test_demographics[test_demographics["Client ID"].duplicated()]

Empty DataFrame
Columns: [Client ID, Age, Gender, County, Income Group]
Index: []

In [18]:
test_demographics.isnull().sum()

Client ID       0
Age             0
Gender          0
County          0
Income Group    0
dtype: int64

In [19]:
test_demographics.describe()

          Client ID          Age       Gender
count   2000.000000  2000.000000  2000.000000
mean   11000.500000    48.386500     0.509000
std      577.494589    17.710193     0.500044
min    10001.000000    20.000000     0.000000
25%    10500.750000    33.000000     0.000000
50%    11000.500000    48.000000     1.000000
75%    11500.250000    63.000000     1.000000
max    12000.000000    80.000000     1.000000

In [20]:
test_demographics.shape

(2000, 5)

In [21]:
#Reading the previous products held by clients data file

In [22]:
test_pre_product = pd.read_csv("Test_Sample/TEST_Product_Held_in_Bank.csv",encoding='latin1')

In [23]:
test_pre_product = test_pre_product[['Unnamed: 0','Unnamed: 1']]

In [24]:
test_pre_product.columns = test_pre_product.iloc[0]
test_pre_product.drop(test_pre_product.index[0], inplace = True)

In [25]:
test_pre_product["Client ID"]= test_pre_product["Client ID"].astype(int)
test_pre_product["# Products in bank"]= test_pre_product["# Products in bank"].astype(int)

In [26]:
test_pre_product.dtypes

0
Client ID             int64
# Products in bank    int64
dtype: object

In [27]:
test_pre_product[test_pre_product["Client ID"].duplicated()]

Empty DataFrame
Columns: [Client ID, # Products in bank]
Index: []

In [28]:
test_pre_product.isnull().sum()

0
Client ID             0
# Products in bank    0
dtype: int64

In [29]:
test_pre_product.describe()

0         Client ID  # Products in bank
count   2000.000000         2000.000000
mean   11000.500000            3.003000
std      577.494589            1.409604
min    10001.000000            1.000000
25%    10500.750000            2.000000
50%    11000.500000            3.000000
75%    11500.250000            4.000000
max    12000.000000            5.000000

In [30]:
test_pre_product.shape

(2000, 2)

In [31]:
#Reading the Transactions data file

In [32]:
test_transactions = pd.read_csv("Test_Sample/ModelBuild_Transactions_out_of_Current_Account.csv",encoding='latin1')

In [33]:
test_transactions.head()

,Client,Num Transactions,Last TXN Amount,Merchant Code,Last Transaction Narrative
0,10706,4,879.40,3700,0002 - MOTEL 6 SANTA BARBARACA
1,11992,2,898.46,3700,0025 - MOTEL 6 GILROY CA
2,11284,4,216.43,4723,0340708011347459044271351BERLIN
3,10412,27,330.20,5021,121 OFFICE FURNITURE CUMBERNAULD
4,11183,9,1010.39,6300,123 MONEY LTD DUBLIN 18

In [34]:
test_transactions.rename(columns = {"Client":"Client ID"}, inplace = True)

In [35]:
test_transactions.sort_values('Client ID', inplace = True)

In [36]:
test_transactions.dtypes

Client ID                       int64
Num Transactions                int64
Last TXN Amount               float64
Merchant Code                   int64
Last Transaction Narrative     object
dtype: object

In [37]:
test_transactions[test_transactions["Client ID"].duplicated()]

Empty DataFrame
Columns: [Client ID, Num Transactions, Last TXN Amount, Merchant Code, Last Transaction Narrative]
Index: []

In [38]:
test_transactions.isnull().sum()

Client ID                     0
Num Transactions              0
Last TXN Amount               0
Merchant Code                 0
Last Transaction Narrative    0
dtype: int64

In [39]:
test_transactions.describe()

          Client ID  Num Transactions  Last TXN Amount  Merchant Code
count   2000.000000       2000.000000      2000.000000    2000.000000
mean   11000.500000         16.339000       594.084485    4806.407000
std      577.494589         24.264263       378.781884    1784.107396
min    10001.000000          0.000000         1.250000     742.000000
25%    10500.750000          4.000000       267.935000    3509.000000
50%    11000.500000          7.000000       588.195000    3787.500000
75%    11500.250000         10.000000       907.842500    5945.000000
max    12000.000000        100.000000      5200.240000    9405.000000

In [40]:
test_transactions.shape

(2000, 5)

In [41]:
#Reading the Transaction amount data file

In [42]:
test_txn_amount = pd.read_csv("Test_Sample/TEST_TXN_Amount.csv",encoding='cp1252')

In [43]:
test_txn_amount = test_txn_amount[['Unnamed: 0','Unnamed: 1']]

In [44]:
test_txn_amount.columns = test_txn_amount.iloc[0]
test_txn_amount.drop(test_txn_amount.index[0], inplace = True)

In [45]:
test_txn_amount.head()

0 Client ID Average amount of CA transaction
1     10001                               22
2     10002                               11
3     10003                                9
4     10004                               34
5     10005                               38

In [46]:
test_txn_amount["Client ID"]= test_txn_amount["Client ID"].astype(int)
test_txn_amount["Average amount of CA transaction"]= test_txn_amount["Average amount of CA transaction"].astype(int)

In [47]:
test_txn_amount.dtypes

0
Client ID                           int64
Average amount of CA transaction    int64
dtype: object

In [48]:
test_txn_amount[test_txn_amount["Client ID"].duplicated()]

Empty DataFrame
Columns: [Client ID, Average amount of CA transaction]
Index: []

In [49]:
test_txn_amount.isnull().sum()

0
Client ID                           0
Average amount of CA transaction    0
dtype: int64

In [50]:
test_txn_amount.describe()

0         Client ID  Average amount of CA transaction
count   2000.000000                       2000.000000
mean   11000.500000                       1239.594000
std      577.494589                        965.085733
min    10001.000000                          0.000000
25%    10500.750000                        318.750000
50%    11000.500000                       1181.500000
75%    11500.250000                       2033.500000
max    12000.000000                       9470.000000

In [51]:
#Merging all the dataframes to form a final test dataframe

In [52]:
test_df = pd.merge(test_demographics,test_txn_amount,  how='left', left_on=['Client ID'], right_on = ['Client ID'])

In [53]:
test_df = pd.merge(test_df,test_pre_product,  how='left', left_on=['Client ID'], right_on = ['Client ID'])

In [54]:
test_df = pd.merge(test_df,test_pre_loan,  how='left', left_on=['Client ID'], right_on = ['Client ID'])

In [55]:
test_df = pd.merge(test_df,test_transactions,  how='left', left_on=['Client ID'], right_on = ['Client ID'])

In [56]:
test_df.head()

,Client ID,Age,Gender,County,Income Group,Average amount of CA transaction,# Products in bank,Held Loan previously,Num Transactions,Last TXN Amount,Merchant Code,Last Transaction Narrative
0,10001,59,1,Cork,10001 - 40000,22,4,0,2,12.59,7375,MYWHEELS IE DUBLIN 2
1,10002,27,1,Kerry,10001 - 40000,11,4,0,0,30.00,7531,MAXOL/MACE BRENNAN'S NEWBRIDGE
2,10003,58,0,Louth,10001 - 40000,9,2,0,28,1003.01,5533,Finglas Autoparts Limit Dublin
3,10004,45,1,Dublin,60001 - 100000,34,2,0,31,873.25,3692,DOUBLETREE CHELSEA
4,10005,21,0,Dublin,40001 - 60000,38,1,0,12,926.75,3659,TAJ HOTELS INTERNATIONAL Aurangabad

In [57]:
test_df.shape

(2000, 12)

In [58]:
test_df.to_csv("Test_Sample/test_mergedData.csv", index = False)

In [59]:
#This merged test file is used as a test set for the final predictor

<h3>Test set description</h3>

In [60]:
#2000 rows with 12 attributes
#No missing or NUll values